oaq_specification/examples/dot/active_reset.dot
strict digraph "" {
    node [label="\N"];
    "NumericExpression1" [label="200", shape=box];
    "Port1" [label="Port", shape=box];
    "Port1" -> "NumericExpression1"  [label="Id", style=dashed];
    "Frequency1" [label="7 GHz", shape=box];
    "Radians2" [label="0 rad", shape=box];
    "Frequency3" [label="20 MHz", shape=box];
    "Frame1" [label="Frame", shape=box];
    "Frame1" -> "Port1"  [label="Port", style=dashed];
    "Frame1" -> "Frequency1"  [label="Frequency", style=dashed];
    "Frame1" -> "Radians2"  [label="Phase", style=dashed];
    "Frame1" -> "Frequency3"  [label="IntermediateFrequency", style=dashed];
    "Interval4" [label="1 μs", shape=box];
    "Waveform1" [label="ConstantWaveform", shape=box];
    "Waveform1" -> "Interval4"  [label="Duration", style=dashed];
    "Instruction3" [label="ModulatedPulse", shape=box];
    "Instruction3" -> "Frame1"  [label="Frame", style=dashed];
    "Instruction3" -> "Waveform1"  [label="Envelope", style=dashed];
    "NumericExpression2" [label="0.2", shape=box];
    "Amplitude5" [label="Amplitude", shape=box];
    "Amplitude5" -> "NumericExpression2"  [label="Value", style=dashed];
    "Instruction3" -> "Amplitude5"  [label="Amplitude", style=dashed];
    "NumericExpression3" [label="300", shape=box];
    "Port2" [label="Port", shape=box];
    "Port2" -> "NumericExpression3"  [label="Id", style=dashed];
    "Interval6" [label="1 μs", shape=box];
    "ComplexRangeExpression1" [label="AcquisitionComplexRangeResult", shape=box];
    "Instruction4" [label="AdcAcquisition", shape=box];
    "Instruction4" -> "Port2"  [label="Port", style=dashed];
    "Instruction4" -> "Interval6"  [label="Duration", style=dashed];
    "Instruction4" -> "ComplexRangeExpression1"  [label="Result", style=dashed];
    "Instruction5:Alignment" [label="StartToStart", shape=box];
    "Instruction5:Relationship" [label="InstructionRelationship", shape=box];
    "Instruction5:Relationship" -> "Instruction5:Alignment"  [label="Alignment", style=dashed];
    "Instruction5" [label="Dependency", shape=box];
    "Instruction5" -> "Instruction5:Relationship"  [label="Relationship", style=dashed];
    "Instruction5" -> "Instruction3"  [label="Lhs", style=dashed];
    "Instruction5" -> "Instruction4"  [label="Rhs", style=dashed];
    "ComplexRangeExpression2" [label="Demodulation", shape=box];
    "ComplexRangeExpression2" -> "Frame1"  [label="Frame", style=dashed];
    "ComplexRangeExpression2" -> "ComplexRangeExpression1"  [label="Trace", style=dashed];
    "ComplexRangeExpression3:Values" [label="(0, 0), (1, 2), (3, 4)", shape=box];
    "ComplexRangeExpression3" [label="LiteralComplexRange", shape=box];
    "ComplexRangeExpression3" -> "ComplexRangeExpression3:Values"  [label="Values", style=dashed];
    "ComplexExpression1" [label="ComplexDotProduct", shape=box];
    "ComplexExpression1" -> "ComplexRangeExpression2"  [label="Lhs", style=dashed];
    "ComplexExpression1" -> "ComplexRangeExpression3"  [label="Rhs", style=dashed];
    "NumericExpression4" [label="ComplexRealValue", shape=box];
    "NumericExpression4" -> "ComplexExpression1"  [label="Operand", style=dashed];
    "NumericExpression5" [label="5", shape=box];
    "BooleanExpression1" [label="GreaterThan", shape=box];
    "BooleanExpression1" -> "NumericExpression4"  [label="Lhs", style=dashed];
    "BooleanExpression1" -> "NumericExpression5"  [label="Rhs", style=dashed];
    "NumericExpression6" [label="100", shape=box];
    "Port3" [label="Port", shape=box];
    "Port3" -> "NumericExpression6"  [label="Id", style=dashed];
    "Frequency7" [label="5 GHz", shape=box];
    "Radians8" [label="0 rad", shape=box];
    "Frequency9" [label="10 MHz", shape=box];
    "Frame2" [label="Frame", shape=box];
    "Frame2" -> "Port3"  [label="Port", style=dashed];
    "Frame2" -> "Frequency7"  [label="Frequency", style=dashed];
    "Frame2" -> "Radians8"  [label="Phase", style=dashed];
    "Frame2" -> "Frequency9"  [label="IntermediateFrequency", style=dashed];
    "Interval10" [label="100 ns", shape=box];
    "Waveform2" [label="ConstantWaveform", shape=box];
    "Waveform2" -> "Interval10"  [label="Duration", style=dashed];
    "Instruction6" [label="ModulatedPulse", shape=box];
    "Instruction6" -> "Frame2"  [label="Frame", style=dashed];
    "Instruction6" -> "Waveform2"  [label="Envelope", style=dashed];
    "NumericExpression7" [label="0.5", shape=box];
    "Amplitude11" [label="Amplitude", shape=box];
    "Amplitude11" -> "NumericExpression7"  [label="Value", style=dashed];
    "Instruction6" -> "Amplitude11"  [label="Amplitude", style=dashed];
    "Interval12" [label="100 ns", shape=box];
    "Instruction7" [label="Delay", shape=box];
    "Instruction7" -> "Interval12"  [label="Duration", style=dashed];
    "Instruction8" [label="BlockConditional", shape=box];
    "Instruction8" -> "BooleanExpression1"  [label="Guard", style=dashed];
    "Instruction8" -> "Instruction6"  [label="TrueCase1", style=dashed];
    "Instruction8" -> "Instruction7"  [label="FalseCase1", style=dashed];
    "Instruction9:Alignment" [label="EndToStart", shape=box];
    "Instruction9:Relationship" [label="InstructionRelationship", shape=box];
    "Instruction9:Relationship" -> "Instruction9:Alignment"  [label="Alignment", style=dashed];
    "Instruction9" [label="Dependency", shape=box];
    "Instruction9" -> "Instruction9:Relationship"  [label="Relationship", style=dashed];
    "Instruction9" -> "Instruction5"  [label="Lhs", style=dashed];
    "Instruction9" -> "Instruction8"  [label="Rhs", style=dashed];
    "Job" [label="Job", shape=box];
    "Job" -> "Instruction9"  [label="EntryPoint1", style=dashed];
}
